app/views/users/show.html.erb


    <% if @user.entries.any? %>
---
SELECT  1 AS one FROM "entries" WHERE "entries"."user_id" = ? LIMIT 1  [["user_id", 1]]