app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize current_user.entries.count, "entry" %></span>
---
SELECT "entries".* FROM "entries" WHERE (user_id = 1)  ORDER BY "entries"."created_at" DESC
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]