app/controllers/comments_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 298]]
INSERT INTO "comments" ("name", "content", "entry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "alo"], ["content", "adasdasdas"], ["entry_id", 298], ["created_at", "2015-05-09 04:44:15.350863"], ["updated_at", "2015-05-09 04:44:15.350863"]]
---
	def create
		@entry = Entry.find(params[:comment][:entry_id])
		@comment = current_user.comments.build(comment_params)
		@comment.entry = @entry

		if @comment.save