app/controllers/entries_controller.rb

	def create
		@entry = current_user.entries.build(entry_params)
		if @entry.save
---
INSERT INTO "entries" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdfsdf"], ["body", "vxcvxcvx"], ["user_id", 1], ["created_at", "2015-05-08 05:45:34.718239"], ["updated_at", "2015-05-08 05:45:34.718239"]]

	def show
		@entry = Entry.find(params[:id])
		@comment = @entry.comments.build
		@comments = @entry.comments.paginate(page: params[:page])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 30 OFFSET 0  [["entry_id", 301]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 301]]