app/controllers/password_resets_controller.rb

  def update
    if password_blank?
      flash.now[:danger] = "Password can't be blank"
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$.5hVqpKdjkxtDChWcVfqIuDgPRQxlWB22vd.uzgHF2bakN3F8jrTC"], ["updated_at", "2015-05-07 16:19:25.554037"], ["id", 102]]