app/controllers/static_pages_controller.rb

SELECT  "entries".* FROM "entries" WHERE (user_id = 1)  ORDER BY "entries"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "entries" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def home
    if signed_in?
      @entry = current_user.entries.build
      @feed_items = current_user.feed.paginate page: params[:page]