app/controllers/users_controller.rb

def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

def destroy
    User.find params[:id].destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

def index
    @users = User.paginate page: params[:page]
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

def show
    @user = User.find params[:id]
    @entries = @user.entries.paginate page: params[:page]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]

def update
    @user = User.find params[:id]
    if @user.update_attributes user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$R0dGBbBQQ1HiEPdPJBMnL.BsyurUyj1bKvJnsedmSPavbpSmwuOPm"], ["updated_at", "2015-05-07 07:17:04.558576"], ["id", 1]]

def following
    @title = "Following"
    @user  = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

def followers
    @title = "Followers"
    @user  = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]